----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1           [-1, 128, 39960]           3,200
       BatchNorm1d-2           [-1, 128, 39960]             256
         LeakyReLU-3           [-1, 128, 39960]               0
            Conv1d-4            [-1, 64, 39960]          24,640
       BatchNorm1d-5            [-1, 64, 39960]             128
         LeakyReLU-6            [-1, 64, 39960]               0
            Conv1d-7            [-1, 64, 39960]          12,352
       BatchNorm1d-8            [-1, 64, 39960]             128
            Conv1d-9            [-1, 64, 39960]          24,640
        LeakyReLU-10            [-1, 64, 39960]               0
        MaxPool1d-11            [-1, 64, 13320]               0
   Residual_block-12            [-1, 64, 13320]               0
           Conv1d-13            [-1, 64, 13320]          12,352
      BatchNorm1d-14            [-1, 64, 13320]             128
        LeakyReLU-15            [-1, 64, 13320]               0
           Conv1d-16            [-1, 64, 13320]          12,352
      BatchNorm1d-17            [-1, 64, 13320]             128
        LeakyReLU-18            [-1, 64, 13320]               0
        MaxPool1d-19             [-1, 64, 4440]               0
   Residual_block-20             [-1, 64, 4440]               0
           Conv1d-21            [-1, 128, 4440]          24,704
      BatchNorm1d-22            [-1, 128, 4440]             256
        LeakyReLU-23            [-1, 128, 4440]               0
           Conv1d-24            [-1, 128, 4440]          49,280
      BatchNorm1d-25            [-1, 128, 4440]             256
           Conv1d-26            [-1, 128, 4440]          24,704
        LeakyReLU-27            [-1, 128, 4440]               0
        MaxPool1d-28            [-1, 128, 1480]               0
   Residual_block-29            [-1, 128, 1480]               0
           Conv1d-30            [-1, 128, 1480]          49,280
      BatchNorm1d-31            [-1, 128, 1480]             256
        LeakyReLU-32            [-1, 128, 1480]               0
           Conv1d-33            [-1, 128, 1480]          49,280
      BatchNorm1d-34            [-1, 128, 1480]             256
        LeakyReLU-35            [-1, 128, 1480]               0
        MaxPool1d-36             [-1, 128, 493]               0
   Residual_block-37             [-1, 128, 493]               0
           Conv1d-38             [-1, 128, 493]          49,280
      BatchNorm1d-39             [-1, 128, 493]             256
        LeakyReLU-40             [-1, 128, 493]               0
           Conv1d-41             [-1, 128, 493]          49,280
      BatchNorm1d-42             [-1, 128, 493]             256
        LeakyReLU-43             [-1, 128, 493]               0
        MaxPool1d-44             [-1, 128, 164]               0
   Residual_block-45             [-1, 128, 164]               0
           Conv1d-46             [-1, 128, 164]          49,280
      BatchNorm1d-47             [-1, 128, 164]             256
        LeakyReLU-48             [-1, 128, 164]               0
           Conv1d-49             [-1, 128, 164]          49,280
      BatchNorm1d-50             [-1, 128, 164]             256
        LeakyReLU-51             [-1, 128, 164]               0
        MaxPool1d-52              [-1, 128, 54]               0
   Residual_block-53              [-1, 128, 54]               0
           Conv1d-54              [-1, 128, 54]          49,280
      BatchNorm1d-55              [-1, 128, 54]             256
        LeakyReLU-56              [-1, 128, 54]               0
           Conv1d-57              [-1, 128, 54]          49,280
      BatchNorm1d-58              [-1, 128, 54]             256
        LeakyReLU-59              [-1, 128, 54]               0
        MaxPool1d-60              [-1, 128, 18]               0
   Residual_block-61              [-1, 128, 18]               0
           Conv1d-62              [-1, 128, 24]          16,512
      BatchNorm1d-63              [-1, 128, 24]             256
        LeakyReLU-64              [-1, 128, 24]               0
AdaptiveAvgPool1d-65               [-1, 128, 1]               0
AdaptiveMaxPool1d-66               [-1, 128, 1]               0
           Linear-67                  [-1, 128]          32,896
           Linear-68                   [-1, 10]           1,280
================================================================
Total params: 636,736
Trainable params: 636,736
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.66
Forward/backward pass size (MB): 357.60
Params size (MB): 2.43
Estimated Total Size (MB): 363.68
----------------------------------------------------------------
