Model: "model_20"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_39 (InputLayer)           [(None, 240000, 2)]  0                                            
__________________________________________________________________________________________________
conv1d_707 (Conv1D)             (None, 20000, 128)   3200        input_39[0][0]                   
__________________________________________________________________________________________________
batch_normalization_633 (BatchN (None, 20000, 128)   512         conv1d_707[0][0]                 
__________________________________________________________________________________________________
leaky_re_lu_517 (LeakyReLU)     (None, 20000, 128)   0           batch_normalization_633[0][0]    
__________________________________________________________________________________________________
conv1d_708 (Conv1D)             (None, 19998, 64)    24640       leaky_re_lu_517[0][0]            
__________________________________________________________________________________________________
batch_normalization_634 (BatchN (None, 19998, 64)    256         conv1d_708[0][0]                 
__________________________________________________________________________________________________
leaky_re_lu_518 (LeakyReLU)     (None, 19998, 64)    0           batch_normalization_634[0][0]    
__________________________________________________________________________________________________
conv1d_709 (Conv1D)             (None, 19996, 64)    12352       leaky_re_lu_518[0][0]            
__________________________________________________________________________________________________
batch_normalization_635 (BatchN (None, 19996, 64)    256         conv1d_709[0][0]                 
__________________________________________________________________________________________________
conv1d_710 (Conv1D)             (None, 19994, 64)    12352       batch_normalization_635[0][0]    
__________________________________________________________________________________________________
leaky_re_lu_519 (LeakyReLU)     (None, 19994, 64)    0           conv1d_710[0][0]                 
__________________________________________________________________________________________________
max_pooling1d_291 (MaxPooling1D (None, 6664, 64)     0           leaky_re_lu_519[0][0]            
__________________________________________________________________________________________________
residual_block_214 (Residual_bl (None, 2221, 64)     25216       max_pooling1d_291[0][0]          
__________________________________________________________________________________________________
residual_block_down_35 (Residua (None, 740, 128)     83328       residual_block_214[0][0]         
__________________________________________________________________________________________________
residual_block_215 (Residual_bl (None, 246, 128)     99584       residual_block_down_35[0][0]     
__________________________________________________________________________________________________
residual_block_216 (Residual_bl (None, 82, 128)      99584       residual_block_215[0][0]         
__________________________________________________________________________________________________
residual_block_217 (Residual_bl (None, 27, 128)      99584       residual_block_216[0][0]         
__________________________________________________________________________________________________
residual_block_218 (Residual_bl (None, 9, 128)       99584       residual_block_217[0][0]         
__________________________________________________________________________________________________
residual_block_219 (Residual_bl (None, 3, 128)       99584       residual_block_218[0][0]         
__________________________________________________________________________________________________
conv1d_726 (Conv1D)             (None, 3, 128)       16512       residual_block_219[0][0]         
__________________________________________________________________________________________________
batch_normalization_650 (BatchN (None, 3, 128)       512         conv1d_726[0][0]                 
__________________________________________________________________________________________________
leaky_re_lu_534 (LeakyReLU)     (None, 3, 128)       0           batch_normalization_650[0][0]    
__________________________________________________________________________________________________
global_average_pooling1d_35 (Gl (None, 128)          0           leaky_re_lu_534[0][0]            
__________________________________________________________________________________________________
global_max_pooling1d_35 (Global (None, 128)          0           leaky_re_lu_534[0][0]            
__________________________________________________________________________________________________
tf.concat_20 (TFOpLambda)       (None, 256)          0           global_average_pooling1d_35[0][0]
                                                                 global_max_pooling1d_35[0][0]    
__________________________________________________________________________________________________
dense_70 (Dense)                (None, 64)           16448       tf.concat_20[0][0]               
__________________________________________________________________________________________________
dense_71 (Dense)                (None, 10)           650         dense_70[0][0]                   
==================================================================================================
Total params: 694,154
Trainable params: 690,058
Non-trainable params: 4,096